# 5 Uses in Lambda Functions

- lambda function == anonymous function,
- is one of the core concepts in functional programming.
- Python supports multi programming paradigms.
- Lambda function simplicity makes our Python code more elegant in some using scenarios.
- A `lambda` operator or `lambda` function is used for creating small, one-time, anonymous function objects in Python.

three parts:

- A **lambda keyword**
- **Arguments** that the function will receive
- An **expression** whose result is the return value of the function

Syntax: lambda arguments : expression

##### Use 1: Give It a Name and Use It As Normal

In [2]:
# conventional function

def add_ten(x):
    return x + 10

print(add_ten(5))

15

In [1]:
# normal function

def double(x):
    result = x*2
    return result

In [2]:
double(9)

18

#### Examples:

In [ ]:
lambda v1,v2 : expression

In [3]:
# Lambda function

lambda_add_ten = lambda x: x + 10

print(lambda_add_ten(5))

15

### lambda function

In [3]:
# Double input value 

d = lambda x: x*2
print(d(5))

(lambda x: x*2)(6)

10

12

In [4]:
# Square input value

s = lambda x: x**2
print(s(9))

(lambda x : x**2)(9)

81

81

In [5]:
# multiple Values/ Variables

p = lambda x,y: x**y
print(p(2,3))

(lambda x,y : x**y)(2,3)

8

8

# Important Concept: Iterable VS Iterator
Iterator is a subclass of Iterable. 
- An Iterable object, such as 
    - list ,
    - tuple , 
    - dict , 
    - set and 
    - str , 
        - can produce an Iterator by iter() function.
        
An iterable:
- any objects that can be iterated by the 
    - for...in... loop 
        - is an Iterable object.

The difference:        
- Iterable can print its all elements at once.

In [11]:
my_list = [1, 2, 3, 4, 5]
print(type(my_list))

# This is an iterable

<class 'list'>

In [12]:
# Take the function iter() and add an iterable == iterator 

my_list_iterator = iter(my_list)
print(type(my_list_iterator))

# Python’s list object has implemented __iter__() method, so 
# we can using iter(my_list) to convert it to an Iterator. 
# In a simple case, we can just return self in the __iter__() method.

# The __next__() defines a method to produce items. 
# it defines how next() function works to get the next item.

<class 'list_iterator'>

An Iterator 
- is also an Iterable since it’s the subclass of Iterable. 
    - can check it using isinstance() function:

In [13]:
from collections.abc import Iterable, Iterator
my_list = [1, 2, 3, 4, 5]
my_list_iterator = iter(my_list)

In [14]:
isinstance(my_list,Iterable)

True

In [15]:
isinstance(my_list,Iterator)

False

In [16]:
isinstance(my_list_iterator,Iterable)

True

In [17]:
isinstance(my_list_iterator,Iterator)

True

The difference between an Iterator and Iterable:
- Iterator works as a “factory” which saves a method to produce elements and 
- we can only produce elements one by one using next() function. 
- We can not print all elements at one time, cause 
    - an Iterator only knows the method of how to produce elements and never really contains any elements.

Python has this special design Because its operating a large container (list/set/dict and so on) 
- which is often very time-consuming and inefficient in Python. 

We don’t need to use all the elements at once, we only need to use one element at a time. 
- it’s a great idea that saving a method and produce an element when we need one rather than saving all elements.
- It reduces both time and space cost.

Explained:
- Iterable object in Python is an object which can be iterated (by for loop). 
- Iterator is subclass of Iterable but it contains an item producing method rather than items.

##### Get An Iterator
1. Using `iter()` function
- it’s convenient to convert an Iterable to an Iterator by iter().

2. Implement `__iter__()` and `__next__()` methods
- An Iterator object must implement two special methods: `__iter__()` and `__next__()` . 
- We can define this two methods by ourselves and make a object be an Iterator.
    - The `__iter__()`is the method called on initialization of an Iterator. 
    - This should return an object that has `__next__()` method.
        -  it defines how `iter()` function works to return an Iterator.
    - Python’s list object has implemented __iter__() method, so we can using iter(my_list) to convert it to an Iterator. 
    - In a simple case, we can just return self in the __iter__() method.
    - The `__next__()` defines a method to produce items. 
        - it defines how `next()` function works to get the next item.

In [18]:
# this is a class to produce Fibonacci numbers:

from collections.abc import Iterable, Iterator

class Fib(object):
    def __init__(self):
        self.a, self.b = 0, 1

    def __iter__(self):
        return self

    def __next__(self):
        self.a, self.b = self.b, self.a + self.b
        if self.a > 1000:  # set a limitation to stop
            raise StopIteration()
        return self.a


f = Fib()
print(isinstance(f, Iterator))
print(next(f))
print(next(f))
print(next(f))
print(next(f))

True
1
1
2
3

### Using Generator
Defining the above two special methods every time might be abit complex.

Python’s generator mechanism can help us do these all.

Generator is an subclass of Iterator.

The generator is a convenient and powerful tool in Python to produce Iterators.

Python has Generators:
- get an Iterator by implementing the `__iter__()` and `__next__()` special methods in a Python class.
    - Much mor complex and one would need to undrstand how the Iterators really work. 
- Creating Iterators by generators is a much better and convenient way.

Iterator is a subclass of Iterable and Generator is a subclass of Iterator.

A Generator,
- is used to save a method which knows how to produce required elements. 
- Operating a large list in Python is very time consuming. 
- If we just need to get one element every time, generator is a very good choice to reduce both 
    - time and 
    - space costs.

In [19]:
from collections.abc import Iterable, Iterator

def Fib(max):
    n, a, b = 0, 0, 1
    while n < max:
        yield b
        a, b = b, a + b
        n = n + 1
    return 'done'


f = Fib(10000)

print(isinstance(f, Iterator))
print(next(f))
print(next(f))
print(next(f))
print(next(f))

True
1
1
2
3

#### How to Get a Generator?
1. Generator Expression

The generator expression is the simplest way to get a generator. It’s very similar with list comprehensions. We just need to change the brackets to parentheses.

Generator saves item producing method rather than items, 
- use next() function to get items one by one, (which is the same as an Iterator.)
    - When all items were produced, the next() function will raise a StopIteration error information. 
- use a for loop to get items in a generator.

In [20]:
my_list = [i for i in range(8)]
my_generator = (i for i in range(8))

print(my_list)
print(my_generator)

[0, 1, 2, 3, 4, 5, 6, 7]
<generator object <genexpr> at 0x000002C3B4AA5DD0>

2. Use yield to Define a Generator

If a function includes the yield statement, it can produce generators.
- The yield means “produce”. When the programme meets a yield statement, it “produces” an item and the next() function pauses there.

The key difference between normal functions and functions including yield is the execution flow:
- A normal function executes sequentially, and return results when encountering the return statement or arriving the final line.
- A function including yield is executed when next() is called and returns when the yield statement is encountered. 
    - When next() is called again, it continues from the yield statement paused last time.

In [23]:
def my_generator(maximum):
    n = 0
    while n < maximum:
        n += 1
        yield n
    return 'Done'


g = my_generator(maximum=5)

next(g)
# 1
next(g)
# 2
next(g)
# 3
next(g)
# 4
next(g)
# 5
next(g)

StopIteration: Done

In [24]:
def example():
    print('step 1')
    yield 1
    print('step 2')
    yield 2
    print('step 3')
    yield 3
    
g = example()

next(g)
# step 1
# 1
next(g)
# step 2
# 2
next(g)
# step 3
# 3
next(g)

step 1
step 2
step 3

StopIteration:

A function including yield statement is not itself a generator. 
- It is still a function but it can return a generator every time it is called. 

A generator is a class rather than a function.
- next() can only be used for a generator. It cannot be used to a function.

In [25]:
def my_generator(maximum):
    n = 0
    while n < maximum:
        yield n
    return 'Done'

print(type(my_generator))
# <class 'function'>
print(type(my_generator(5)))
# <class 'generator'>

print(next(my_generator(5)))
# 0
print(next(my_generator))

<class 'function'>
<class 'generator'>
0

TypeError: 'function' object is not an iterator

Generators can help us save an algorithm to produce items and generate items when needed. 
- Comparing with a huge list containing all items, a generator reduce the time and memory costs.
- Generator can even represent an infinite stream of data.

Here, The fib is an infinite generator, we can use it based on our requirements.

In [26]:
def fibonacci():
    x, y = 0, 1
    while True:
        x, y = y, x + y
        yield x

fib = fibonacci()

Combine a series of generators to get a new generator, which is technically called “pipeline”.

In [27]:
def times_two(nums):
    for n in nums:
        yield n * 2

def natural_number(maximum):
    x = 0
    while x < maximum:
        yield x
        x += 1

p = times_two(natural_number(10))
print(type(p))
print(next(p))
print(next(p))
print(next(p))
print(next(p))
print(next(p))
print(next(p))

<class 'generator'>
0
2
4
6
8
10

### How for loops actually work in Python?

Any objects that can be iterated by for loops is an Iterable.

This is how for loops actually work in Python:
1. Convert an Iterable to be an Iterator.
2. Use next() function to get every element until stop.

Simplest implementation of for loop to help you understand:

In [28]:
# convert an Iterable to an Iterator
my_list_iterator = iter(my_list)

while True:
    try:
        # get the next item
        element = next(my_list_iterator)
    except StopIteration:
        # if StopIteration is raised, stop for loop
        break

### Use 2: Cooperate With Higher Order Functions

Higher Order Function contains other functions as parameters or returns functions.
- concept of functional programming. 

There are some built-in higher order functions in Python and we can also define higher order functions by ourselves.

These three functions well can help us avoid too much for loops in our code and makes it more elegant and readable.
- Use lambda functions together with higher order functions, such as 
    - map(), 
    - filter()
    - reduce()
    
Firstly, lambda functions, also known as an anonymous function, start with the keyword lambda.
- lambda functions are a short version of the normal function that takes one expression and needs no return statement at the end.

The syntax of Lambda Function

`lambda arguments : expression`

In [29]:
# Example: multiply two cells, instead of doing it manually, we can just use a lambda function.

import pandas as pd, numpy as np

multi = lambda x, y: x*y
multi(5,6)

30

### When is the best time to use the Lambda Function?
Use lambda functions the most when working with 
- lists, 
- series or 
- data frames in python and pandas; 

Especially when there is an operation or transformation that needs to happen to a pandas series or data frame.

# #######################################################################################################################

# Map()
Used to provide direction to the computer to connect to the elements within a container-list
- The map() function is an alternative to the “for loop” where we call every element of a container as:
    - “for i in container”. 
- The in-built function map() processes and transforms all the elements of an iterable.


- The map() function receives two parameters, 
    - function and
    - Iterable. 
- It applies the initialized function to each element of the sequence in turn, and returns the result as a new Iterator.
- The map()transform values in a Series or DataFrame based on a mapping or function. 
    - apply custom transformations to our data.
- The map() method only works on panda series 
    - where different types of operation can be applied to the items in the series.
    
Syntax:

Series.map(arg, na_action=None)
- arg: parameter can take one of the following:
    - **A dictionary**: It maps current values to new values.
    - **A Series**: It uses the Series values to perform the mapping
    - **A function**: It applies the function to each element in the Series.
- na_action (optional): This parameter specifies what to do with missing values (NaNs). 
    - It can be one of 
        - 'ignore' (default), 
        - 'raise', or 
        - None.
    
how does map() function work
- When you apply the map(function) method on a series, 
    - the map() function takes each element in the series and applies the function to it, and 
    - returns the transformed series.

In [ ]:
# mapping allows us to loop over a list with lambda funtion and preceding it with map function

map(lambda v1: expression , iterable-sequence)

map(function_object, iterable1, iterable2,...)

Map functions expect a function object and any number of iterables, such as
- list, 
- dictionary

It executes the function_object for each element in the sequence and returns a list of the elements modified by the function object.

In Python3, the map function returns an iterator or map object which gets lazily evaluated,
- similar to how the zip function is evaluated. 
    - Lazy evaluation is explained in more detail in the zip function article.
    
Cant dos:
- We Cannot access the elements of the map object with index 
- nor we can use len() to find the length of the map object.

We can:
- force convert the map output, 
    - i.e. the map object, to list

##### Mapping Values Using a Dictionary:

In [80]:
data = {'A':['apple','banana','cherry','apple']}
df3=pd.DataFrame(data)
df3

        A
0   apple
1  banana
2  cherry
3   apple

In [81]:
fruit_to_color= {'apple':'red', 'banana':'yellow', 'cherry':'red'}

In [83]:
df3['color']=df3['A'].map(fruit_to_color)

In [84]:
df3

        A   color
0   apple     red
1  banana  yellow
2  cherry     red
3   apple     red

##### Mapping Values Using a Series:

In [85]:
color_series=pd.Series(['red','yellow','red'], index=['apple','banana','cherry'])

In [86]:
df3['Color2']=df3['A'].map(color_series)

In [87]:
df3

        A   color  Color2
0   apple     red     red
1  banana  yellow  yellow
2  cherry     red     red
3   apple     red     red

##### Mapping value by Applying a Function:

In [88]:
data = {'Numbers': [1, 2, 3, 4]} 
df10 = pd.DataFrame(data)
df10

   Numbers
0        1
1        2
2        3
3        4

In [89]:
def square(x):
    return x ** 2

In [90]:
df10['Squared'] = df10['Numbers'].map(square)

In [91]:
df10

   Numbers  Squared
0        1        1
1        2        4
2        3        9
3        4       16

##### Example of applying a function: Handling Missing Values:

In [92]:
data = {'A': [1, 2, np.nan, 4]} 
df11 = pd.DataFrame(data)  
df11

     A
0  1.0
1  2.0
2  NaN
3  4.0

In [93]:
def custom_function(x):
    return x * 2 if not pd.isna(x) else x

In [94]:
df11['Doubled'] = df11['A'].map(custom_function)

In [95]:
df11

     A  Doubled
0  1.0      2.0
1  2.0      4.0
2  NaN      NaN
3  4.0      8.0

In [6]:
# Example 1:

numbers = [2,3,4,5]

list(map(lambda a: a**2, numbers))

[4, 9, 16, 25]

In [5]:
# Example 2: calculate the square of each number in a list

def f(x):
    return x * x

In [8]:
j = map(f, [1, 2, 3, 4, 5, 6, 7, 8, 9])

In [10]:
print(j)

<map object at 0x000002C3B49DD790>

In [6]:
r = map(f, [1, 2, 3, 4, 5, 6, 7, 8, 9])
print(list(r))

[1, 4, 9, 16, 25, 36, 49, 64, 81]

In [2]:
# Example 2.2:

map_output = map(lambda x: x*2, [1, 2, 3, 4])
print(map_output)

<map object at 0x0000029FB7496640>

In [3]:
list_map_output = list(map_output)

print(list_map_output)

[2, 4, 6, 8]

In [42]:
# Example 3:
def multiply2(x):
    return x * 2
    
list(map(multiply2, [1, 2, 3, 4]))

[2, 4, 6, 8]

- map executes the multiply2 function for each element in the list, [1, 2, 3, 4], and returns [2, 4, 6, 8].

In [44]:
list(map(lambda x : x*2, [1, 2, 3, 4]))

[2, 4, 6, 8]

In [30]:
# Example 4:

from sklearn.datasets import load_iris
data = load_iris()
features = pd.DataFrame(data = data['data'], columns= data ['feature_names'])
features.head()

   sepal length (cm)  sepal width (cm)  petal length (cm)  petal width (cm)
0                5.1               3.5                1.4               0.2
1                4.9               3.0                1.4               0.2
2                4.7               3.2                1.3               0.2
3                4.6               3.1                1.5               0.2
4                5.0               3.6                1.4               0.2

In [31]:
# Series example : let's say, we would like to change the measurement of the sepal length from cm to mm, 
# with the map function and put a function call cm_to_mm inside. 
def cm_to_mm(cm):
    mm = cm * 10
    return mm

features['sepal length (cm)'].map(cm_to_mm).head()

0    51.0
1    49.0
2    47.0
3    46.0
4    50.0
Name: sepal length (cm), dtype: float64

In [ ]:
#  This function can be easily transformed into a lambda function.

lambda x: x*10

Define this function with 
- the keyword, and then 
- the variable x is our argument followed 
- by : just like any normal function we define. 
- The part after the colon :is the expression where 
    - it takes x and multiplies it by 10. 
    - the lambda function only takes one expression.
        - You can feed it only one input, and 
        - it will return one output.
        
lambda functions are useful because it only takes one thing and returns one thing,
- This feature fits perfectly with map(), apply(), and applymap() where 
    - They take the function and apply it to every element in a series or data frame individually, then 
    - Return the transformed output.

##### Iterating Over a Dictionary Using Map and Lambda

- Each dict of dict_a will be passed as a parameter to the lambda function. 
- The result of the lambda function expression for each dict will be given as output.

In [46]:
dict_a = [{'name': 'python', 'points': 10}, {'name': 'java', 'points': 8}]

In [53]:
list(map(lambda x : x['name'], dict_a))

['python', 'java']

In [54]:
list(map(lambda x : x['points']*10,  dict_a))

[100, 80]

In [55]:
list(map(lambda x : x['name'] == "python", dict_a))

[True, False]

##### Multiple Iterables to the Map Function

- Where we pass multiple sequences to the map functions 
    - each i^th element of list_a and list_b will be passed as an argument to the lambda function.

In [1]:
list_a = [1, 2, 3]
list_b = [10, 20, 30]
  
list(map(lambda x, y: x + y, list_a, list_b))

[11, 22, 33]

# ######################################################################################################################

If we want to do it on two columns, this does not work. This is when we will need the apply() function.

### Use Cases of Lambda and Apply functions in Pandas

# Apply()
- The apply () method works on panda series and data frames with a variety of functions easily applied depending on the datatype.
    - It is the method used to modify or perform operations on the dataframe or series

How does apply() function work
- Use the apply() method on a series or a data frame, 
    - the function takes each element in the series and apply the function onto the element, then 
    - returns the transformed series or data frame.
    
Specify axis you want your function to acts on
- Setting axis = 0, the operation is acted columnwise.
- Setting axis = 1, the operation is acted rowwise.

Used with anonymous functions or lambda functions. 
- Lambda function iterate over the rows of the dataframe and grab the values of columns 
    - by specifying axis to act on, 
        - The “apply()” method that we want to apply the function to act on the rows instead of columns.
            - This method takes a function as an input and applies this function to an entire dataframe.
            
            
##### 2 ways to use the Apply Function:
- Python fuction.
- User defines and lambda function

##### Python Function

In [32]:
#what if we want to do it on two columns? 
features[['sepal length (cm)',"sepal width (cm)"]].apply(cm_to_mm).head()

   sepal length (cm)  sepal width (cm)
0               51.0              35.0
1               49.0              30.0
2               47.0              32.0
3               46.0              31.0
4               50.0              36.0

In [33]:
# with apply()
features[['sepal length (cm)','sepal width (cm)',
          'petal length (cm)','petal width (cm)']].apply(cm_to_mm).head()

   sepal length (cm)  sepal width (cm)  petal length (cm)  petal width (cm)
0               51.0              35.0               14.0               2.0
1               49.0              30.0               14.0               2.0
2               47.0              32.0               13.0               2.0
3               46.0              31.0               15.0               2.0
4               50.0              36.0               14.0               2.0

##### Lambda Function

In [36]:
# Instead of the cm_to_mm function, I will just the lambda function to tranform the dataset 

features[['sepal length (cm)']].apply(lambda x: x*10).head()

   sepal length (cm)
0               51.0
1               49.0
2               47.0
3               46.0
4               50.0

In [38]:
# Create a new column with existing columns

# create a list of all the columns' name 
col_name = ['sepal length (cm)', 'sepal width (cm)', 'petal length (cm)', 'petal width (cm)']

# create a new column call interation using lambda and apply function 
features['interaction'] = features.apply(lambda x : x[col_name[0]]*x[col_name[1]]* x[col_name[2]]* x[col_name[3]], axis = 1)

features.head()

,sepal length (cm),sepal width (cm),petal length (cm),petal width (cm),interaction
0,5.1,3.5,1.4,0.2,4.9980
1,4.9,3.0,1.4,0.2,4.1160
2,4.7,3.2,1.3,0.2,3.9104
3,4.6,3.1,1.5,0.2,4.2780
4,5.0,3.6,1.4,0.2,5.0400

The apply function will allow us to pass a function over an axis of our DataFrame:
- By default, Axis = 0 is column-wise, chich means that we are grabbing our coulmns and apply the function down that column
- specify axis= 1, which means that we are grabbing all of our row elements within their specified columns and applying our function.

lambda functions are disposable, and often just use the variable x as a placeholder for whatever they're operating on:
- because we’re operating on our rows, x becomes a row each time our function is applied.
- we can specify which columns we want to operate on, noting that those column values will be multiplied by the same column in that row.

In [39]:
# let's say we have a dataframe with names 
name = pd.DataFrame(data = ['Braund, Mr. Owen Harris',
 'Cumings, Mrs. John Bradley (Florence Briggs Thayer)',
 'Heikkinen, Miss. Laina',
 'Futrelle, Mrs. Jacques Heath (Lily May Peel)',
 'Allen, Mr. William Henry',
 'Moran, Mr. James',
 'McCarthy, Mr. Timothy J',
 'Palsson, Master. Gosta Leonard',
 'Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)',
 'Nasser, Mrs. Nicholas (Adele Achem)'], columns = ['Name'] )

#Take a look at the Data 
name.head()

                                                Name
0                            Braund, Mr. Owen Harris
1  Cumings, Mrs. John Bradley (Florence Briggs Th...
2                             Heikkinen, Miss. Laina
3       Futrelle, Mrs. Jacques Heath (Lily May Peel)
4                           Allen, Mr. William Henry

In [40]:
#Let's say, I want to extract the Titles of each name, we can do this: 

name['Name'].apply(lambda x: x.split(" ")[1].replace(".", ""))

#save this output to "title"
name['Title'] = name['Name'].apply(lambda x: x.split(" ")[1].replace(".", ""))

#take a look at out dataframe 
name

                                                Name   Title
0                            Braund, Mr. Owen Harris      Mr
1  Cumings, Mrs. John Bradley (Florence Briggs Th...     Mrs
2                             Heikkinen, Miss. Laina    Miss
3       Futrelle, Mrs. Jacques Heath (Lily May Peel)     Mrs
4                           Allen, Mr. William Henry      Mr
5                                   Moran, Mr. James      Mr
6                            McCarthy, Mr. Timothy J      Mr
7                     Palsson, Master. Gosta Leonard  Master
8  Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)     Mrs
9                Nasser, Mrs. Nicholas (Adele Achem)     Mrs

In [24]:
import numpy as np
import pandas as pd

In [18]:
# Example:

borrower ="Ritch","Lisa","Fred","Gregor","Esther","Willis","Margt","Phylis","Naomi","Douglas"
amount = 234.9,672.5,246.3,893.2,748.7,254.7,758.8,375.7,346.7,234.9
salary = 201.67,234.88,235.23,642.56,476.56,233.45,453.67,362.12,234.45,345.56
data = pd.DataFrame({"borrower":borrower,"amount":amount,"salary":salary})
data

  borrower  amount  salary
0    Ritch   234.9  201.67
1     Lisa   672.5  234.88
2     Fred   246.3  235.23
3   Gregor   893.2  642.56
4   Esther   748.7  476.56
5   Willis   254.7  233.45
6    Margt   758.8  453.67
7   Phylis   375.7  362.12
8    Naomi   346.7  234.45
9  Douglas   234.9  345.56

In [22]:
df_len = pd.DataFrame({'Borrower' : data['borrower'], 'Name_lenths' : data['borrower'].apply( lambda x: len(x))})
df_len

  Borrower  Name_lenths
0    Ritch            5
1     Lisa            4
2     Fred            4
3   Gregor            6
4   Esther            6
5   Willis            6
6    Margt            5
7   Phylis            6
8    Naomi            5
9  Douglas            7

In [25]:
data["ceil_amount"] = data.amount.apply(np.ceil)

In [27]:
data.loc[0:5,['borrower','amount',"ceil_amount"]]

  borrower  amount  ceil_amount
0    Ritch   234.9        235.0
1     Lisa   672.5        673.0
2     Fred   246.3        247.0
3   Gregor   893.2        894.0
4   Esther   748.7        749.0
5   Willis   254.7        255.0

In [28]:
data["floor_salary"] = data.salary.apply(np.floor)
data.loc[0:5,['borrower','salary',"floor_salary"]]

  borrower  salary  floor_salary
0    Ritch  201.67         201.0
1     Lisa  234.88         234.0
2     Fred  235.23         235.0
3   Gregor  642.56         642.0
4   Esther  476.56         476.0
5   Willis  233.45         233.0

In [29]:
# Finding the maximum values of all rows of the columns and Return the maximum values of the columns.

data.loc[:,["salary","amount"]].apply(max,axis =1)

0    234.90
1    672.50
2    246.30
3    893.20
4    748.70
5    254.70
6    758.80
7    375.70
8    346.70
9    345.56
dtype: float64

In [30]:
# Returning the maximum values of the columns.

data.loc[:,["salary","amount"]].apply(max,axis =0)

salary    642.56
amount    893.20
dtype: float64

In [32]:
data

  borrower  amount  salary  ceil_amount  floor_salary
0    Ritch   234.9  201.67        235.0         201.0
1     Lisa   672.5  234.88        673.0         234.0
2     Fred   246.3  235.23        247.0         235.0
3   Gregor   893.2  642.56        894.0         642.0
4   Esther   748.7  476.56        749.0         476.0
5   Willis   254.7  233.45        255.0         233.0
6    Margt   758.8  453.67        759.0         453.0
7   Phylis   375.7  362.12        376.0         362.0
8    Naomi   346.7  234.45        347.0         234.0
9  Douglas   234.9  345.56        235.0         345.0

In [72]:
# Returns indices of the maximum elements within specified columns 

data.loc[:,["salary","amount"]].apply(np.argmax,axis = 0)

salary    3
amount    3
dtype: int64

In [79]:
# give me the name

name = data['borrower'][data.apply(lambda x: True if x['salary'] ==  data["salary"].max() and x['amount'] == data['amount'].max() else False, axis = 1)]
name

3    Gregor
Name: borrower, dtype: object

##### Apply() with User defined Function

In [38]:
def collect(file):
    df= pd.read_csv(file)   
    return df

In [39]:
df = collect(r"C:\Users\Siphamandla Mandindi\Documents\Explore_Data_Science\Sprint_3_Python_for_DS\CompetencyAssessment_TS\Demand Analyst -- Case Study -- Data.csv")

In [40]:
df

    warehouse        date  total_orders
0         EW1  2021-08-10           455
1         EW1  2021-08-11           553
2         EW1  2021-08-12           569
3         EW1  2021-08-13           426
4         EW1  2021-08-14           536
..        ...         ...           ...
140       EW2  2021-11-04          1490
141       EW2  2021-11-05          1067
142       EW2  2021-11-06          1591
143       EW2  2021-11-07          1696
144       EW2  2021-11-08          1537

[145 rows x 3 columns]

In [41]:
# function to sum all values of the rows, columnwise
def calc_max(x):
    return x.max()

In [45]:
df.select_dtypes(int).apply(calc_max,axis=0)

Series([], dtype: float64)

In [46]:
# function to sum all values of the columns,rowwise
def calc_sum1(f):
    return f.sum()

In [47]:
df.select_dtypes(float).apply(calc_sum1,axis =1)

0      0.0
1      0.0
2      0.0
3      0.0
4      0.0
      ...
140    0.0
141    0.0
142    0.0
143    0.0
144    0.0
Length: 145, dtype: float64

In [51]:
# Proportion of each and every sepal width.
def round_val(h):
    return np.round((h/sum(df.total_orders))*100,4)

In [52]:
df["total_orders"].apply(round_val)

0      0.4713
1      0.5729
2      0.5894
3      0.4413
4      0.5553
        ...
140    1.5435
141    1.1053
142    1.6482
143    1.7569
144    1.5922
Name: total_orders, Length: 145, dtype: float64

In [53]:
# Difference between the minimum and maximum values(range) in all floating columns
def cal_diff(fs):
    return np.max(fs) - np.min(fs)

In [54]:
df.select_dtypes(float).apply(cal_diff,axis=0)

Series([], dtype: float64)

In [ ]:
def cal_diff(fs):
    return fs[0] - fs[1]
df["SepaLSepWdiff"]= df[["Sepal_Length","Sepal_Width"]].apply(cal_diff,axis=1)

In [ ]:
plt.plot(df[ df["Species"]=="setosa"].SepaLSepWdiff,label="setosa")
plt.plot(df[ df["Species"]=="virginica"].SepaLSepWdiff,label="virginica")
plt.plot(df[ df["Species"]=="versicolor"].SepaLSepWdiff,label= "versicolor")
plt.legend()
plt.show();

##### Apply Function with lambda

In [58]:
height = 173,168,171,168,171,167,173,167,182
weight = 60,70,67,77,83,67,59,56,110
df2= pd.DataFrame({"height":height,"weight":weight})
df2

   height  weight
0     173      60
1     168      70
2     171      67
3     168      77
4     171      83
5     167      67
6     173      59
7     167      56
8     182     110

In [59]:
def calc_bmi(weight,height):
    return np.round(weight/(height/100)**2,2)

In [60]:
df2["bmi"]=df2.apply(lambda x:calc_bmi(x['weight'],x['height']),axis=1)
df2

   height  weight    bmi
0     173      60  20.05
1     168      70  24.80
2     171      67  22.91
3     168      77  27.28
4     171      83  28.38
5     167      67  24.02
6     173      59  19.71
7     167      56  20.08
8     182     110  33.21

In [62]:
#Grouping 
def indicator (bmi):
    if(bmi < 18.5):
        return 'Group 1'
    elif (18.5 <= bmi <25):
        return 'Group 2'
    elif (25 <= bmi < 30):
        return 'Group 3'
    else:
        return 'Group 4'
df2['bmi_indicator'] = df2['bmi'].apply(indicator)  
df2

   height  weight    bmi bmi_indicator
0     173      60  20.05       Group 2
1     168      70  24.80       Group 2
2     171      67  22.91       Group 2
3     168      77  27.28       Group 3
4     171      83  28.38       Group 3
5     167      67  24.02       Group 2
6     173      59  19.71       Group 2
7     167      56  20.08       Group 2
8     182     110  33.21       Group 4

In [63]:
#proportion of of those with heigh difference greater than 5
mask = df2['height'].apply(lambda x: df2.height- x > 5)
mask[0].value_counts(normalize=True)

False    0.777778
True     0.222222
Name: 0, dtype: float64

In [64]:
#condition selection with user defined function
def indicator (bmi):
    if(bmi < 18.5):
        return 'UnderWeight'
    elif (18.5 <= bmi <25):
        return 'Fit'
    elif (25 <= bmi < 30):
        return 'OverWeight'
    else:
        return 'Obese'
df2['bmi_indicator'] = df2['bmi'].apply(indicator)  
df2

   height  weight    bmi bmi_indicator
0     173      60  20.05           Fit
1     168      70  24.80           Fit
2     171      67  22.91           Fit
3     168      77  27.28    OverWeight
4     171      83  28.38    OverWeight
5     167      67  24.02           Fit
6     173      59  19.71           Fit
7     167      56  20.08           Fit
8     182     110  33.21         Obese

##### Filtering with Lambda

In [65]:
#conditioning values of the multiple columns
#conditioning values of the multiple columns
df2 = df2[df2.apply(lambda x: True if x["bmi"]>24 and  x['height'] > 165 else False, axis=1)]
df2

   height  weight    bmi bmi_indicator
1     168      70  24.80           Fit
3     168      77  27.28    OverWeight
4     171      83  28.38    OverWeight
5     167      67  24.02           Fit
8     182     110  33.21         Obese

##### USE CASE 1: Adding a numeric value to columns
- how to add values to the columns of a DataFrame.

In [2]:
import pandas as pd

# Define a lambda function that adds 10 to each element of a DataFrame
add_10 = lambda x: x + 10

In [3]:
# Create a DataFrame
df = pd.DataFrame({'A': [1, 2, 3], 'B': [4, 5, 6]})
df

   A  B
0  1  4
1  2  5
2  3  6

In [4]:
# Apply the lambda function to each element of the DataFrame
df.apply(add_10)

    A   B
0  11  14
1  12  15
2  13  16

##### USE CASE 2: Max/Min of columns/rows
- use the ‘apply’ method on a DataFrame to apply a lambda function that can find the maximum or minimum of values within columns or rows of a DataFrame.

In [5]:
# Create a DataFrame
df2 = pd.DataFrame({'A': [1, 2, 3], 'B': [4, 5, 6]})
df2

   A  B
0  1  4
1  2  5
2  3  6

In [6]:
# Define a lambda function that calculates the maximum of each row or column of a DataFrame
max_value = lambda x: x.max()

In [7]:
# Apply the lambda function to each row of the DataFrame
df2.apply(max_value, axis=1)

0    4
1    5
2    6
dtype: int64

In [8]:
# Apply the lambda function to each column of the DataFrame
df2.apply(max_value, axis=0)

A    3
B    6
dtype: int64

##### USE CASE 3: Difference between min and max of each column
- Use apply with lambda to find the difference between the minimum and maximum values within each column of the DataFrame.

In [9]:
# Define a lambda function that calculates the difference between the maximum and minimum value of each column in a DataFrame
range_ = lambda x: x.max() - x.min()

# Create a DataFrame
df = pd.DataFrame({'A': [1, 2, 3], 'B': [4, 5, 6]})

# Apply the lambda function to each column of the DataFrame
df.apply(range_)

A    2
B    2
dtype: int64

##### USE CASE 4: String Manipulation
- working with the string columns, we need to perform data manipulation such as 
    - converting strings to lowercase, 
    - splitting the sentences into words, 
    - string replacement

In [10]:
# Define a lambda function that converts a string to lowercase
to_lower = lambda x: x.str.lower() if isinstance(x, object) else x

# Create a DataFrame
df3 = pd.DataFrame({'A': ['A', 'B', 'C'], 'B': ['X', 'Y', 'Z']})
df3

   A  B
0  A  X
1  B  Y
2  C  Z

In [12]:
# Apply the lambda function to each element of the DataFrame
df3.apply(to_lower)

   A  B
0  a  x
1  b  y
2  c  z

##### USE CASE 5: Normalisation of variable
Data normalization is a very important step before applying machine learning algorithms

In Example: using apply method with the lambda function to normalize the values within the columns of a DataFrame.

In [13]:
# Define a lambda function that normalizes the values of a DataFrame
normalize = lambda x: (x - x.mean()) / x.std()

# Create a DataFrame
df4 = pd.DataFrame({'A': [1, 2, 3], 'B': [4, 5, 6], 'C': [7, 8, 9]})

# Apply the lambda function to each element of the DataFrame
df4.apply(normalize)

     A    B    C
0 -1.0 -1.0 -1.0
1  0.0  0.0  0.0
2  1.0  1.0  1.0

##### USE CASE 6: Replace missing values

Missing value treatment is part of the data cleaning process that can be implemented using apply and lambda functions

In [14]:
# Define a lambda function that replaces missing values in a DataFrame with a specified value
replace_missing = lambda x, value: x.fillna(value)

# Create a DataFrame
df6 = pd.DataFrame({'A': [1, 2, None], 'B': [None, 5, 6]})
df6

     A    B
0  1.0  NaN
1  2.0  5.0
2  NaN  6.0

In [15]:
# Apply the lambda function to each element of the DataFrame
df6.apply(replace_missing, args=(0,))

     A    B
0  1.0  0.0
1  2.0  5.0
2  0.0  6.0

##### USE CASE 7: Cumulative Sum
We can also find the cumulative sum of columns of a pandas DataFrame using the apply and lambda function as shown below.

In [16]:
# Define a lambda function that calculates the cumulative sum of each column in a DataFrame
cumsum = lambda x: x.cumsum()

# Create a DataFrame
df = pd.DataFrame({'A': [1, 2, 3], 'B': [4, 5, 6]})

# Apply the lambda function to each column of the DataFrame
df.apply(cumsum)

   A   B
0  1   4
1  3   9
2  6  15

##### USE CASE 8: Moving Average
We can also use apply method with a lambda function to find the moving average of the columns of a DataFrame. This comes in very handy with time series data.

- finding the moving average with a window of 2 (looking at 2 consecutive rows at a time).

In [17]:
# Define a lambda function that calculates the moving average of each column in a DataFrame
moving_average = lambda x: x.rolling(window=2).mean()

# Create a DataFrame
df = pd.DataFrame({'A': [1, 2, 3], 'B': [4, 5, 6]})

# Apply the lambda function to each column of the DataFrame
df.apply(moving_average)

     A    B
0  NaN  NaN
1  1.5  4.5
2  2.5  5.5

# #########################################################################################################################

If we want to change the entire data frame? There are two ways we can do this.

1. with apply().
2. with applymap().

# Applymap()

The applymap() method works on the entire pandas data frame where the input function is applied to every element individually.
- applymap() = appy() + map()

In [34]:
#so this is what we do, we use applymap()
features.applymap(cm_to_mm).head()

   sepal length (cm)  sepal width (cm)  petal length (cm)  petal width (cm)
0               51.0              35.0               14.0               2.0
1               49.0              30.0               14.0               2.0
2               47.0              32.0               13.0               2.0
3               46.0              31.0               15.0               2.0
4               50.0              36.0               14.0               2.0

In [37]:
# Now try it with the entire dataframe 
features.applymap(lambda x: x*10).head()

   sepal length (cm)  sepal width (cm)  petal length (cm)  petal width (cm)
0               51.0              35.0               14.0               2.0
1               49.0              30.0               14.0               2.0
2               47.0              32.0               13.0               2.0
3               46.0              31.0               15.0               2.0
4               50.0              36.0               14.0               2.0

In [35]:
#Let me save this dataframe into a new data frame and rename it 
iris = features.applymap(cm_to_mm).head()
iris.columns = ['sepal length (mm)', 'sepal width (mm)', 
                'petal length (mm)', 'petal width (mm)'] 
iris.head()

   sepal length (mm)  sepal width (mm)  petal length (mm)  petal width (mm)
0               51.0              35.0               14.0               2.0
1               49.0              30.0               14.0               2.0
2               47.0              32.0               13.0               2.0
3               46.0              31.0               15.0               2.0
4               50.0              36.0               14.0               2.0

# #######################################################################################################################

# Filter()

Used to filter out a group of elements based on specified condition and render the elements that fulfill the condition as True or valid and present them as output and 
- those conditions that do not fulfill the condition are invalid or False and are hidden from the output.

The filter function expects two arguments: 
- function_object and 
    - function_object returns a boolean value and is called for each element of the iterable.
- an iterable. 
 
filter returns only those elements for which the function_object returns True.

**Map Comparison**

Like the map function, 
- the filter function also returns a list of elements. 

Unlike map, 
- the filter function can only have one iterable as input.

Similar to map, 
- the filter function in Python3 returns a filter object or the iterator which gets lazily evaluated. 
    - We cannot access the elements of the filter object with index, 
    - nor can we use len() to find the length of the filter object.

In [ ]:
# filtering allows us to select a subset from a particular sequence

filter(lambda parameter : expression , iterable-sequence)

filter(function_object, iterable)

In [105]:
# Example: even and odd
b = [1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20]

In [106]:
even = list(filter(lambda i: i%2 == 0 , b))
odd = list(filter(lambda x: x%2 != 0, b))

In [107]:
even

[2, 4, 6, 8, 10, 12, 14, 16, 18, 20]

In [108]:
odd

[1, 3, 5, 7, 9, 11, 13, 15, 17, 19]

In [110]:
library = [('book1', 1995), ('book2', 2000),
          ('book3', 1996), ('book4', 2001),
          ('book5', 1997), ('book6', 2002),
          ('book7', 1998), ('book8', 2003),
          ('book9', 1999), ('book10', 2004),
          ('book11', 1993), ('book12', 2006),
          ('book13', 1994), ('book14', 2007)]

In [112]:
recent = list(filter(lambda x: x[1] >= 2000, library))
recent

[('book2', 2000),
 ('book4', 2001),
 ('book6', 2002),
 ('book8', 2003),
 ('book10', 2004),
 ('book12', 2006),
 ('book14', 2007)]

In [9]:
# Example: return true for elements > 4
seq = [10,2,8,7,5,4,3,11,0,1]

filt_res = filter(lambda x: x>4, seq)

print(list(filt_res))

[10, 8, 7, 5, 11]

In [5]:
# Example: Even number using filter function

a = [1, 2, 3, 4, 5, 6]
list(filter(lambda x : x % 2 == 0, a))

[2, 4, 6]

In [7]:
# Example: Filter list of dicts

dict_a = [{'name': 'python', 'points': 10}, {'name': 'java', 'points': 8}]

list(filter(lambda x : x['name'] == 'python', dict_a))

[{'name': 'python', 'points': 10}]

# #######################################################################################################################

# Zip()

- zip takes n number of iterables and returns a list of tuples. 
- the ith element of the tuple is created using the ith element from each of the iterables.

In [11]:
list_a = [1, 2, 3, 4, 5]
list_b = ['a', 'b', 'c', 'd', 'e']

zipped_list = list(zip(list_a, list_b))

In [12]:
print(zipped_list)

[(1, 'a'), (2, 'b'), (3, 'c'), (4, 'd'), (5, 'e')]

- zipped_list is a list of tuples where ith tuple i.e (1, ‘a’) is created using the 
    - ith element of list_a i.e 1 
    - ith element of list_b i.e a
    
- If the length of the iterables are not equal, 
    - zip creates the list of tuples of length equal to the smallest iterable.

- zip truncates the extra elements of list_b in the output.

- zip always creates the tuple in the order of iterables from left to right. 
    - list_a will always be before list_b in the output tuples

In [15]:
list_a = [1, 2, 3]
list_b = ['a', 'b', 'c', 'd', 'e']

zipped_list = list(zip(list_a, list_b))

print(zipped_list)

[(1, 'a'), (2, 'b'), (3, 'c')]

##### Unzip a list of tuples

To unzip a list of tuples we:
- zip(*listP_of_tuples). 
    - Unzip creates separate lists.

In [16]:
 zipper_list = [(1, 'a'), (2, 'b'), (3, 'c')]
 
 list_a, list_b = zip(*zipper_list)

In [17]:
list_a

(1, 2, 3)

In [18]:
list_b

('a', 'b', 'c')

zip method returns a zip object instead of a list. 
- This zip object is an iterator. 
- Iterators are lazily evaluated.
    - Lazy evaluation or call-by-need is an evaluation strategy that delays the evaluation of an expression until its value is needed and which also avoids repeated evaluations.
    
Iterators return only one element at a time. 
- len function cannot be used with iterators.
- We can loop over the zip object or the iterator to get the actual list

In [25]:
a = [1, 2, 3]
b = [4, 5, 6]

zipped = zip(a, b)

In [21]:
len(zipped)

TypeError: object of type 'zip' has no len()

In [22]:
zipped[0]

TypeError: 'zip' object is not subscriptable

In [26]:
list_c = list(zipped)
list_c

[(1, 4), (2, 5), (3, 6)]

In [28]:
list_d = list(zipped) 
list_d
# Output []... Output is empty list becuase by the above statement zip got exhausted.

[]

- zipped is a zip object which is an iterator. 
    - Using len function or accessing its element by index gives type error.
- We convert the zip object to a list by list(zipped). 
    - After this, we can use all the methods of list.

Iterators can be evaluated only time. 
- After that, they get exhausted, hence list_d output is an empty list.

# ####################################################################################################################

# Reduce()
In-built function that needs to be imported before use from the
- “function tools” or 
- the “functools” module.

The reduce function is used to apply a particular function over a sequence. 
- The main highlighting feature of the reduce function is that it produces a single output or a single value.

Syntax:

In [ ]:
from functools import reduce
reduce(function,sequence)

In [113]:
from functools import reduce

In [114]:
j = [1,2,3,4,5,6]

In [115]:
prod = reduce(lambda a,b : a * b, j)
prod

720

In [116]:
total = reduce(lambda a,b : a + b, j)
total

21

# ################################################################################################################

# Enumerate()
- is a built-in function that allows to loop over Python iterables while keeping track of indexes of them.
- in other words: iterate over any iterable object and keep track of the index of each item.
- used to iterate sequences.
- then iterating through the elements of a sequence, and if you need both the index and the value of the elements
- it: 
    - takes an iterable object as input and 
    - returns an iterator that generates a tuple containing 
        - the index of each item in the iterable and 
        - the item itself.

Syntax of the Python enumerate() function is:
- enumerate(iterable, start=0)

where:
- iterable — can be any iterable Python object like 
    - string, 
    - tuple, 
    - list, 
    - set, 
    - dictionary, and others.
- start — parameter to specify the starting index (optional). Defaults to 0.

In [ ]:
enumerate(iterable, start=0)

In [ ]:
# traditional imperative programming languages such as C

def seq_to_str_1(data):
    result = ''
    i = 0
    while i < len(data):
        result += f'{i}: {data[i]}\n'
        i += 1
    return result[:-1]

# The loop is executed from i = 0 to the length of the data sequence minus one. 
# For each element in data, its position in the sequence and its value are retrieved and added to the result string variable.

# not very Pythonic

In [ ]:
# More Pythonic

def seq_to_str_2(data):
    result = ''
    for i in range(len(data)):
        result += f'{i}: {data[i]}\n'
    return result[:-1]

### Using the enumerate() built-in function
- creates an iterator of tuples whose elements each contain both the 
    - index and the 
    - corresponding value of the iterated sequence elements. 
    
- This benefits from the strengths of two features:
    - The enumerate built-in function creates an enumerate object, 
        - which is a sequence whose elements are lazily generated. 
        - This may improve the memory consumption of your program.
    - The for loop with which the enumerate function should be used is way more efficient than a 
        - classical while loop to go through the elements of an iterable object.
- useful when you need to iterate over a list or tuple and keep track of the index of each item. 
    - It allows you to write more 
        - concise and 
        - readable code, 
        - eliminating the need for an external counter variable.

Advantages of these:
- Readability of the code.
- Execution time.
- memory consumption

In [ ]:
def seq_to_str_3(data):
    result = ''
    for (i, value) in enumerate(data):
        result += f'{i}: {value}\n'
    return result[:-1]

## Exercise 1: Using enumerate() with lists
Example:
- create a Python list and then use a for loop with enumerate() function to print each element of the list along with the index of each element:

In [117]:
my_list = ['Apple', 'Banana', 'Orange', 'Pineapple']

for i, elem in enumerate(my_list):
    print(i, elem)

0 Apple
1 Banana
2 Orange
3 Pineapple

- We can then use tuple unpacking to assign the index and value to separate variables.

## Exercise 2: Use the start parameter to specify a different starting index
- Specifying a starting index of 1, so the index of the first item in the iterable is 1 instead of 0.

In [1]:
fruits = ['apple', 'banana', 'cherry']

for index, value in enumerate(fruits, start=1):
    print(index, value)

1 apple
2 banana
3 cherry

## Exercise 3: Updating values in a list

In [2]:
numbers = [1, 2, 3, 4, 5, 6]

for index, value in enumerate(numbers):
    if index % 2 == 0:
        numbers[index] = value + 10
        
print(numbers)

[11, 2, 13, 4, 15, 6]

## Exercise 4: Printing a numbered list

In [4]:
tasks = ['clean the house', 'buy groceries', 'do laundry']

for index, task in enumerate(tasks, start=1):
    print(f"{index}. {task}")

1. clean the house
2. buy groceries
3. do laundry

## Exercise 5: Using enumerate() with strings
- works with strings, since they are iterable objects.
- in case of strings we will be iterating over each character in a string and 
    - printing it out along with its index (position) in a string:

In [118]:
my_string = 'Apple'

for i, char in enumerate(my_string):
    print(i, char)

0 A
1 p
2 p
3 l
4 e

## Exercise 6: Creating a dictionary from a list
- use the enumerate() function to create a dictionary from a list, where the keys are the index of the items and the values are the items themselves.

In [3]:
fruits = ['apple', 'banana', 'cherry']

fruits_dict = {}

for index, value in enumerate(fruits):
    fruits_dict[index] = value
    
print(fruits_dict)

{0: 'apple', 1: 'banana', 2: 'cherry'}

## Exercise 7: Using enumerate() with dictionaries - Iterating over dictionary keys
While key-value pairs in the dictionary are not ordered and not indexed, 
- using enumerate() can be a very useful option for your code.

difference in the output is that 
- when iterating over a dictionary, you have the option of iterating over 
    - dictionary keys, 
    - dictionary values, or 
    - dictionary key-value pairs.

In [120]:
my_dict = {
    'Apple': 3,
    'Banana': 1,
    'Orange': 2,
    'Pineapple': 5
    }

for i, key  in enumerate(my_dict.keys()):
    print(i, key)

0 Apple
1 Banana
2 Orange
3 Pineapple

## Execise 8: Using enumerate() with dictionaries - Iterating over dictionary values

In [121]:
my_dict = {
    'Apple': 3,
    'Banana': 1,
    'Orange': 2,
    'Pineapple': 5
    }

for i, value  in enumerate(my_dict.values()):
    print(i, value)

0 3
1 1
2 2
3 5

## Exercise 8: Iterating over dictionary key-value pairs
iterating over key-value pairs combined with enumerate() functionality, 
- the output you will get is 
    - each index and a 
    - tuple containing the key-value pair at each entry in the dictionary:

In [119]:
my_dict = {
    'Apple': 3,
    'Banana': 1,
    'Orange': 2,
    'Pineapple': 5
    }

for i, (key, value) in enumerate(my_dict.items()):
    print(i, (key, value))

0 ('Apple', 3)
1 ('Banana', 1)
2 ('Orange', 2)
3 ('Pineapple', 5)

## Performance optimization
- enumerate() function is slow for large iterables.
    - because the function generates a new tuple for each item in the iterable, which can be memory-intensive.
- Use the zip() function instead of enumerate() in some cases. 
- The zip() function takes 
    - multiple iterable objects as input and 
    - returns an iterator that generates tuples containing the corresponding elements from each iterable.
    
The zip() function is used to iterate over two lists and print the corresponding elements. 
- This is more memory-efficient than using enumerate() because it generates tuples only for the corresponding elements, rather than for each item in the iterables.

## Exercise 9: Using enumerate() with zip()
Using enumerate() with another Python function
- functionality of the two functions combined allows to iterate over multiple lists at the same time while keeping track of indexes of pairs of elements

In [122]:
fruits = ['Apple', 'Banana', 'Orange', 'Pineapple']
prices = [3, 1, 2, 5]

for i, (fruit, price) in enumerate(zip(fruits, prices)):
    print(i, fruit, price)

0 Apple 3
1 Banana 1
2 Orange 2
3 Pineapple 5

## Advanced Use of Enumerate in List Comprehensions
- Combine enumerate with list comprehensions for efficient operations

## Exercise 10: Combine enumerate with list comprehensions

In [5]:
fruits = ["apple", "banana", "cherry"]
indexed_fruits = [(index, fruit) for index, fruit in enumerate(fruits)]

print(indexed_fruits)

[(0, 'apple'), (1, 'banana'), (2, 'cherry')]

# #######################################################################################################################

# Range()
Looking at the for loops, and understanding the range function and how it works.
- The range function is often used together with a for loop.

Syntax of the Range Function:

In [99]:
for i in range(5):
    print(i)

0
1
2
3
4

How it works:
- The range function generates a bunch of numbers based on the input
    - The range function behaves differently when we pass in different numbers of arguments
        - When we pass in 1 argument n into range, 
            - it generates numbers from 0 to n-1. 
            - The argument that we pass in is the end argument, which is excluded.
        - When we pass in 2 arguments n,m into range
            -  first argument is the start and 
            - the second argument is the end.
            - Instead of starting from 0, the numbers generated now start from the start. The end is still excluded.
        - When we pass in 3 arguments l,m,n  into range
            - the first argument is the start, 
            - the second argument is the end and 
            - the third argument is the step. 
            - step here refers to the incremental step that the numbers increase/decrease by.
- i is a variable name that you set
- Add colon and indentation

##### Pass in 1 argument into range

In [98]:
for j in range(3):
    print(j)

0
1
2

In [100]:
for k in range(10):
    print(k)

0
1
2
3
4
5
6
7
8
9

##### Pass in 2 argument into range

In [101]:
for l in range(3,7):
    print(l)

3
4
5
6

In [102]:
for m in range(10,13):
    print(m)

10
11
12

##### Pass in 3 arguments into range

In [103]:
for p in range(1,10,2):
    print(p)

1
3
5
7
9

In [104]:
# The Range Function with a Negative Step can generate numbers to descend
for o in range(5,1,-1):
    print(o)

5
4
3
2